{
  "basics": {
    "name": "Jalyna Schröder",
    "label": "Software Engineer",
    "picture": "images/jalyna.jpeg",
    "email": "jalyna.schroeder@gmail.com",
    "website": "http://jalyna.github.io",
    "summary": "A passionate software engineer with a can-do attitude. Experienced with large scaled web applications. Learns new technologies and agile methods in her spare time and is interested in leadership.",
    "location": {
      "city": "Berlin",
      "countryCode": "DE"
    },
    "profiles": [
      {
        "network": "Twitter",
        "username": "jalynas",
        "url": "https://twitter.com/jalynas"
      },
      {
        "network": "Github",
        "username": "jalyna",
        "url": "https://github.com/jalyna"
      },
      {
        "network": "Exercism.io",
        "username": "jalyna",
        "url": "https://exercism.io/jalyna"
      }
    ]
  },
  "work": [
    {
      "company": "Descape GmbH",
      "position": "Full Stack Software Engineer",
      "website": "http://descape.com",
      "startDate": "2016-03-15",
      "summary": "Descape is a marketplace for sustainable travel experiences outside of the office.",
      "highlights": [
        "Taking over an existing Ruby on Rails application as the first developer in the company",
        "Monitoring and keeping the application running"
      ]
    },
    {
      "company": "DaWanda GmbH",
      "position": "Full Stack Software Engineer",
      "website": "http://dawanda.com",
      "startDate": "2013-09-01",
      "endDate": "2016-01-31",
      "summary": "DaWanda is an online marketplace for handmade products and supplies that is mostly developed in Ruby in a Scrum enviroment. DaWanda serves hundreds of millions of page impressions per month.",
      "highlights": [
        "Working with Ruby on Rails and Sinatra and developing RESTful APIs",
        "Frontend Development with Javascript in a MV* Framework and SMACSS architecture",
        "Improving tooling and introducing peer reviews"
      ]
    },
    {
      "company": "Innobox GmbH",
      "position": "Work Student",
      "website": "http://innobox.de",
      "startDate": "2012-03-01",
      "endDate": "2013-08-30",
      "summary": "Innobox is a web agency in the area of online shops mostly built with Groovy and Grails."
    },
    {
      "company": "University of Bremen",
      "position": "Tutorin für Praktische Informatik I",
      "website": "http://www.uni-bremen.de/",
      "startDate": "2010-10-01",
      "endDate": "2011-03-30"
    }
  ],
  "volunteer": [
    {
      "organization": "Rails Girls Berlin",
      "position": "Coach",
      "website": "http://railsgirlsberlin.de/",
      "startDate": "2013-12-01",
      "summary": "RailsGirls is an organization that offers programming workshops for women."
    }
  ],
  "education": [
    {
      "institution": "University of Bremen",
      "area": "Computer Science",
      "studyType": "Bachelor of Science",
      "startDate": "2009-09-01",
      "endDate": "2013-08-30",
      "gpa": "1.5"
    },
    {
      "institution": "Gymnasium an der Kurt-Schuhmacher-Allee",
      "area": "Mathematics and education science",
      "studyType": "Abitur",
      "startDate": "2006-08-01",
      "endDate": "2009-06-01",
      "gpa": "1.9"
    }
  ],
  "skills": [
    {
      "name": "Software Engineering",
      "keywords": [
        "Ruby",
        "Javascript/CoffeScript",
        "Java",
        "Git",
        "SQL",
        "(Haskell)",
        "(Crystal)"
      ]
    },
    {
      "name": "Web Technologies",
      "keywords": [
        "HTML",
        "(S)CSS",
        "Ruby on Rails",
        "Sinatra",
        "React",
        "Bootstrap"
      ]
    },
    {
      "name": "Practices",
      "keywords": [
        "Scrum",
        "Test Driven Development",
        "Pair Programming"
      ]
    }
  ],
  "languages": [
    {
      "language": "German",
      "fluency": "Native speaker"
    },
    {
      "language": "English",
      "fluency": "Language proficient"
    }
  ],
  "references": [
    {
      "name": "Luca Ongaro, Lead Software Engineer at DaWanda",
      "reference": "I worked with Jalyna at DaWanda GmbH for roughly two years, first as her team lead, and then as a peer in the Core Development Team. She is without doubts one of the most skilled and motivated engineers I know and, despite the young age, very experienced. She puts a lot of importance on code quality, testing and maintainability, and she has the best engineering and problem-solving attitude. I can safely say that Jalyna's work was necessary for the success of several of the most important technical projects that we tackled. As a result, she quickly became part of our Core Development Team, influencing any important technical decision. She'a great team player and I always appreciate her honest attitude and feedback. She's also very organized, and knowledgeable about agile development processes. I absolutely endorse her as a software engineer."
    },
    {
      "name": "Luca Tironi, Full Stack Lead Developer at DaWanda",
      "reference": "Jalyna is one of the most capable and passionate person that I have ever met in my profession. She drove several technological changes in our constellation of applications that improved business goals, customer satisfaction, code quality and developer happiness. She demonstrated robust technical skills in the whole spectrum from client-side javascript to backend and business logic design. She is a skilled software engineer with a focus on finding elegant, maintainable and practical solution to problems. She is an exceptional team leader and tutor, helping and inspiring others to improve their own skills and challenging the team to pursue and achieve the highest standards of quality."
    },
    {
      "name": "Tobias Pfeiffer, Software Engineer",
      "reference": "Jalyna is extremely driven and innovative - she has lots of ideas for businesses as well as for improving existing businesses. Moreover she is very communicative and wants to create something. She is a great full stack developer - whether it is creating an awesome front end or doing serious work in the backend she can do it. But she still knows that the human element in development is the most important."
    }
  ]
}